The connected fitting(s) cannot successfully change to the new slope value. You may try to disconnect the connections on the fitting(s) and try again.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId FabricationPartCannotChangeSlopeError { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationPartCannotChangeSlopeError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationPartCannotChangeSlopeError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace